In [1]:
import pandas as pd
import numpy as np
import os
import glob

from IPython.display import display

%matplotlib inline
import matplotlib.pyplot as plt  # Matlab-style plotting
from IPython.display import display
import seaborn as sns
color = sns.color_palette()
sns.set_style('darkgrid')
print('Packages for Mathematical Computation and visualization imported!')

Packages for Mathematical Computation and visualization imported!

In [2]:
# get data
path = 'C:/Users/user/Desktop/xg-data-analysis/datasets/scrapeddata'
extension = 'csv'
os.chdir(path)
result = glob.glob('*.{}'.format(extension))
print(result)

['clubs-spent-1718.csv', 'clubs-spent-1819.csv', 'clubs-spent-1920.csv', 'clubs-spent-2021.csv', 'clubs-spent-2122.csv', 'clubs-spent-2223.csv', 'clubs-wage-1718.csv', 'clubs-wage-1819.csv', 'clubs-wage-1920.csv', 'clubs-wage-2021.csv', 'clubs-wage-2122.csv', 'clubs-wage-2223.csv']

In [3]:
spent_matching = [s for s in result if "spent" in s]
spent_wage = [s for s in result if "wage" in s]
spent_matching

['clubs-spent-1718.csv',
 'clubs-spent-1819.csv',
 'clubs-spent-1920.csv',
 'clubs-spent-2021.csv',
 'clubs-spent-2122.csv',
 'clubs-spent-2223.csv']

In [4]:
spent_matching[0]

'clubs-spent-1718.csv'

In [5]:
def open_csv(list_):
    lst = []
    for i in range(len(list_)):
        df = pd.read_csv(list_[i])
        lst.append(df)
    return lst

In [6]:
spent = open_csv(spent_matching)
wage = open_csv(spent_wage)

In [7]:
spent[0].dtypes

Club           object
Expenditure    object
Net            object
dtype: object

In [11]:
### deal with k values
def deal_with_thousands(lst_b, columns):
    for i in range(len(lst_b)):
        for j in range(len(lst_b[i])):
            if "k" in lst_b[i][columns][j]:
                lst_b[i][columns][j] = lst_b[i][columns][j].replace('€', '').replace('k', '')
                lst_b[i][columns][j] = float(lst_b[i][columns][j])
                lst_b[i][columns][j] = lst_b[i][columns][j] / 1000
                lst_b[i][columns][j] = str(lst_b[i][columns][j])
            else:
                continue
    return lst_b

### Clean Expense Columns

In [12]:
### deal with k values
for i in range(len(spent)):
    for j in range(len(spent[i])):
        if "k" in spent[i]['Net'][j]:
            spent[i]['Net'][j] = spent[i]['Net'][j].replace('€', '').replace('k', '')
            spent[i]['Net'][j] = float(spent[i]['Net'][j])
            spent[i]['Net'][j] = spent[i]['Net'][j] / 1000
            spent[i]['Net'][j] = str(spent[i]['Net'][j])
        else:
            continue

In [13]:
for i in range(len(spent)):
    for j in range(len(spent[i])):
        if "k" in spent[i]['Expenditure'][j]:
            spent[i]['Expenditure'][j] = spent[i]['Expenditure'][j].replace('€', '').replace('k', '')
            spent[i]['Expenditure'][j] = float(spent[i]['Expenditure'][j])
            spent[i]['Expenditure'][j] = spent[i]['Expenditure'][j] / 1000
            spent[i]['Expenditure'][j] = str(spent[i]['Expenditure'][j])
        else:
            continue

In [14]:
for i in range(len(spent)):
    spent[i]['Expenditure'] = spent[i]['Expenditure'].str.replace('€', '').str.replace('m', '').astype(float)
    spent[i]['Club'] = spent[i]['Club'].str.replace(' FC', '').str.replace(' AFC', '').astype(str)
    spent[i]['Net'] = spent[i]['Net'].str.replace('€', '').str.replace('m', '').str.replace('k', '').astype(float)

In [92]:
spent[0].head(1)

      Club  Expenditure     Net
0  Chelsea        469.3 -191.45

### Clean Wage Bill Columns

In [20]:
wage[0].head()

              Club   WageBill
0   Wigan Athletic     416000
1          Burnley   36556000
2          Chelsea  118026000
3          Arsenal  122983273
4  AFC Bournemouth   43743000

In [17]:
for i in range(len(wage)):
    wage[i]['Club'] = wage[i]['Club'].str.replace(' F.C.', '').str.replace(' A.F.C.', '').astype(str)
    wage[i]['WageBill'] = wage[i]['WageBill'].str.replace('£', '').str.replace(',', '').astype(int)

C:\Users\user\AppData\Local\Temp/ipykernel_1180/2112295659.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  wage[i]['Club'] = wage[i]['Club'].str.replace(' F.C.', '').str.replace(' A.F.C.', '').astype(str)

In [19]:
wage[0].head()

              Club   WageBill
0   Wigan Athletic     416000
1          Burnley   36556000
2          Chelsea  118026000
3          Arsenal  122983273
4  AFC Bournemouth   43743000

### Now Take Data we need

We need the following data:
- Huddersfield, Newcastle and Brighton data from 2017/18 and 2018/19
- Aston Villa and Sheffield United Data for 2019/20 and 2020/21
- Wolves Data from 2018/19 and 2019/20
- Leeds Data from 2020/21 and 2021/22

In [51]:
teams_17 = ['Huddersfield Town', 'Newcastle United', 'Brighton & Hove Albion']
s1_teams_wage = wage[0].loc[wage[0]['Club'].isin(teams_17)]
s1_teams_spent = spent[0].loc[spent[0]['Club'].isin(teams_17)]

s1_teams_wages2 = wage[1].loc[wage[1]['Club'].isin(teams_17)]
s1_teams_spents2 = spent[1].loc[spent[1]['Club'].isin(teams_17)]

In [52]:
teams_18 = ['Wolverhampton Wanderers']
s2_teams_wage = wage[1].loc[wage[1]['Club'].isin(teams_18)]
s2_teams_spent = spent[1].loc[spent[1]['Club'].isin(teams_18)]

s2_teams_wages2 = wage[2].loc[wage[2]['Club'].isin(teams_18)]
s2_teams_spents2 = spent[2].loc[spent[2]['Club'].isin(teams_18)]

In [53]:
teams_19 = ['Aston Villa', 'Sheffield United']
s3_teams_wage = wage[2].loc[wage[2]['Club'].isin(teams_19)]
s3_teams_spent = spent[2].loc[spent[2]['Club'].isin(teams_19)]

s3_teams_wages2 = wage[3].loc[wage[3]['Club'].isin(teams_19)]
s3_teams_spents2 = spent[3].loc[spent[3]['Club'].isin(teams_19)]

In [54]:
teams_20 = ['Leeds United']
s4_teams_wage = wage[3].loc[wage[3]['Club'].isin(teams_20)]
s4_teams_spent = spent[3].loc[spent[3]['Club'].isin(teams_20)]

s4_teams_wages2 = wage[-2].loc[wage[-2]['Club'].isin(teams_20)]
s4_teams_spents2 = spent[-2].loc[spent[-2]['Club'].isin(teams_20)]

In [78]:
df_s1_wagebill = [s1_teams_wage, s2_teams_wage, s3_teams_wage, s4_teams_wage]
df_s2_wagebill = [s1_teams_wages2, s2_teams_wages2, s3_teams_wages2, s4_teams_wages2]
df_s1_exp = [s1_teams_spent, s2_teams_spent, s3_teams_spent, s4_teams_spent]
df_s2_exp = [s1_teams_spents2, s2_teams_spents2, s3_teams_spents2, s4_teams_spents2]
def change_cols_wage(lst_dfs, column_name):
    for i in range(len(lst_dfs)):
        lst_dfs[i].rename(columns={"WageBill": column_name}, inplace = True)
        
def change_cols_spent(lst_dfs, column_name1, column_name2):
    for i in range(len(lst_dfs)):
        lst_dfs[i].rename(columns={"Expenditure": column_name1, "Net": column_name2}, inplace = True)

In [79]:
change_cols_wage(df_s1_wagebill, 'WageBillSeason1')
change_cols_wage(df_s2_wagebill, 'WageBillSeason2')

change_cols_spent(df_s1_exp, 'ExpenditureSeason1', 'NetSpendSeason1')
change_cols_spent(df_s2_exp, 'ExpenditureSeason2', 'NetSpendSeason2')

C:\Users\user\anaconda3\lib\site-packages\pandas\core\frame.py:5039: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [80]:
pd.merge(df_s1_wagebill[0],df_s2_wagebill[0])

                     Club  WageBillSeason1  WageBillSeason2
0        Newcastle United         46176000         43056000
1  Brighton & Hove Albion         38558000         38860666
2       Huddersfield Town         29718000         31033600

In [81]:
dfwages1 = pd.DataFrame()
dfwages2 = pd.DataFrame()
dfwages3 = pd.DataFrame()
dfwages4 = pd.DataFrame()
lst_dfs_out = [dfwages1, dfwages2, dfwages3, dfwages4]
for i in range(len(df_s1_wagebill)):
    lst_dfs_out[i] = pd.merge(df_s1_wagebill[i], df_s2_wagebill[i])

In [84]:
dfspent1 = pd.DataFrame()
dfspent2 = pd.DataFrame()
dfspent3 = pd.DataFrame()
dfspent4 = pd.DataFrame()
lst_dfs_out_wage = [dfspent1, dfspent2, dfspent3, dfspent4]
for i in range(len(df_s1_exp)):
    df = pd.DataFrame()
    df = pd.merge(df_s1_exp[i], df_s2_exp[i])
    lst_dfs_out_wage[i] = pd.merge(df, lst_dfs_out[i])

In [89]:
final_df = pd.concat(lst_dfs_out_wage)
final_df.reset_index(inplace = True)
final_df.drop(columns = ['index'], inplace = True)

In [90]:
final_df

,Club,ExpenditureSeason1,NetSpendSeason1,ExpenditureSeason2,NetSpendSeason2,WageBillSeason1,WageBillSeason2
0,Brighton & Hove Albion,153.62,-139.60,148.86,-126.74,38558000,38860666
1,Huddersfield Town,107.45,-88.67,63.70,-22.27,29718000,31033600
2,Newcastle United,106.25,-33.98,132.65,-45.96,46176000,43056000
3,Wolverhampton Wanderers,229.45,-182.05,204.29,-100.99,39353000,49965000
4,Aston Villa,260.85,-255.08,231.15,-101.38,37962396,56315396
5,Sheffield United,133.20,-132.85,63.00,-35.00,14024000,19708800
6,Leeds United,186.70,-186.70,204.49,-90.99,27826800,29816800

In [91]:
final_df.to_csv('C:/Users/user/Desktop/xg-data-analysis/datasets/scrapeddata/cleaned-wage-spend-clubs.csv')